# Setup

In [9]:
# should be able to import all
import pandas as pd
# import geopandas as gpd
import sqlite3

In [7]:
ls

 Volume in drive C is Blade 14
 Volume Serial Number is 4CAC-55FD

 Directory of C:\Users\Sam\Desktop\DataMiningTrainingSession

17/09/2021  01:18 pm    <DIR>          .
17/09/2021  01:18 pm    <DIR>          ..
17/09/2021  12:24 am    <DIR>          .ipynb_checkpoints
17/09/2021  11:35 am    <DIR>          __pycache__
16/09/2021  12:39 am               410 arithmetic.py
17/09/2021  03:48 am             3,208 Automobile_data.csv
16/09/2021  01:03 am               521 consonants.py
17/09/2021  12:26 am                71 costs.csv
17/09/2021  04:52 am            65,031 datasets.zip
17/09/2021  03:10 am            86,016 db.db
17/09/2021  12:26 am                61 df1.csv
17/09/2021  12:26 am                61 df2.csv
17/09/2021  12:26 am                69 df3.csv
16/09/2021  12:48 am               229 grades.py
17/09/2021  11:35 am               133 imported_module.py
16/09/2021  12:17 am               259 input_method.py
14/09/2021  06:07 pm             8,283 Installation Guide.ipynb
14/09/2021  04:53 pm             3,174 Installation Guide.md
17/09/2021  12:44 am             1,026 json_import.json
17/09/2021  11:35 am               132 main.py
17/09/2021  03:49 am    <DIR>          media
16/09/2021  12:24 am               259 mirror.txt
16/09/2021  11:35 pm            84,361 municipalities.csv
17/09/2021  12:26 am                60 ops.csv
16/09/2021  11:36 pm             4,060 provinces.csv
17/09/2021  12:26 am               277 queueingdata.csv
17/09/2021  12:26 am               147 sales.csv
16/09/2021  02:01 am            27,494 Session1.md
16/09/2021  09:29 pm               764 session1.py
17/09/2021  01:18 pm            27,705 Session2.ipynb
17/09/2021  04:38 am            14,881 Session2.md
17/09/2021  04:39 am           274,395 Session2.pdf
16/09/2021  12:58 am                43 test.txt
16/09/2021  12:24 am               384 writing_files.py
              29 File(s)        603,514 bytes
               5 Dir(s)  777,758,621,696 bytes free

# Pandas and SQL

In [11]:
# sql query
conn = sqlite3.connect('db.db')

print("==show tables==")
query = "SELECT name FROM sqlite_master WHERE type='table';"
print(pd.read_sql_query(query, conn))

print("\n==storing sql table in dataframe==")
query = "SELECT * FROM sql_country"
country_df = pd.read_sql_query(query, conn)
print(country_df)
print(type(country_df))

==show tables==
             name
0     sql_country
1       provinces
2  municipalities
3      sql_people

==storing sql table in dataframe==
   id      country
0   1  Philippines
1   2   Tajikistan
2   3       Brazil
3   4       Brazil
4   5     Colombia
5   6    Indonesia
<class 'pandas.core.frame.DataFrame'>

In [15]:
# json file
json_df = pd.read_json("json_import.json", orient="records")
print(json_df)

   id first_name   last_name                  email       gender
0   1      Smith    Comiskey    scomiskey0@uiuc.edu       Female
1   2     Denice     Poulsom    dpoulsom1@bbc.co.uk      Agender
2   3      Felic     Carlett      fcarlett2@ted.com      Agender
3   4   Mattheus       Laste      mlaste3@hexun.com         Male
4   5       Clay  Chancelier     cchancelier4@is.gd       Female
5   6      Arlie    Hemphall      ahemphall5@gov.uk  Genderqueer
6   7   Hilarius     McCorry     hmccorry6@java.com  Genderfluid
7   8      Valma    Tumielli  vtumielli7@flavors.me         Male
8   9    Felecia     Edgeson     fedgeson8@ebay.com         Male
9  10      Maury     Duignan  mduignan9@archive.org     Bigender

In [16]:
# csv file
df = pd.read_csv("sales.csv")
df

# read_excel
# read_dict

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12

# DataFrames

DataFrame is a collection of variables put together to share the same index
* DataFrames are the workhorse of Pandas algorithms
* Directly inspired from the R programming language
* All series objects must have the same number of elements/rows
* Must have unique column names

#  Column and Row Operation
## Column Operations
* Indexing is done using the square bracket notation ([ ]). 
* Need to specify the column names.
    ```python
    df['name_of_column']
    ```
* New columns can also be created as a function of other columns using the square bracket notation ([ ]). 
    ```python
    df['new_column'] = df['old_column']
    ```
* To delete a specic column, use the drop() command and specify axis=1. Use inplace = True to make it permanent.
    ``` python
    df.drop('column_to_delete', axis =1)
    df.drop('column_to_delete’, axis =1, inplace=True)
    ```

In [21]:
print(df['Person'])
# selecting multiple columns
columns_to_read = ['Person','Sales']
print(df[columns_to_read])

0        Sam
1    Charlie
2        Amy
3    Vanessa
4       Carl
5      Sarah
Name: Person, dtype: object
    Person  Sales
0      Sam    200
1  Charlie    120
2      Amy    340
3  Vanessa    124
4     Carl    243
5    Sarah    350

In [22]:
# creating new columns
df['SalesTax'] = df['Sales'] * df['Tax']
print(df)

  Company   Person  Sales   Tax  SalesTax
0    GOOG      Sam    200  0.12     24.00
1    GOOG  Charlie    120  0.12     14.40
2    MSFT      Amy    340  0.08     27.20
3    MSFT  Vanessa    124  0.07      8.68
4      FB     Carl    243  0.06     14.58
5      FB    Sarah    350  0.12     42.00

In [24]:
# temporary Delete
print(df.drop(['Sales', 'SalesTax'],axis=1))
print(df)

  Company   Person   Tax
0    GOOG      Sam  0.12
1    GOOG  Charlie  0.12
2    MSFT      Amy  0.08
3    MSFT  Vanessa  0.07
4      FB     Carl  0.06
5      FB    Sarah  0.12
  Company   Person  Sales   Tax  SalesTax
0    GOOG      Sam    200  0.12     24.00
1    GOOG  Charlie    120  0.12     14.40
2    MSFT      Amy    340  0.08     27.20
3    MSFT  Vanessa    124  0.07      8.68
4      FB     Carl    243  0.06     14.58
5      FB    Sarah    350  0.12     42.00

In [25]:
# permanently delete column
df.drop('SalesTax',axis=1, inplace = True)
print(df)

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12

## Row Operations

* Indexing is done using the iloc function and square bracket notation ([ ]). Need to specify the row indices.
    ```python
    df.iloc['row_numbers']
    df.iloc[['row_numbers'],['column_numbers']]
    ```
• Using labels, indexing can be done using the loc function and square brackets([ ])
    ``` python
    df.loc['row_names']
    df.loc[['row_names'],['column_names']]
    ```
• Logical indexing can be done using square brackets to select specific rows based on a logical array.
    ``` python
    df.loc['logical_column_vector']
    df.loc[condition1 & condition2 & ...]
    ```

In [49]:
# Df Row Ops
# reset df
df = pd.read_csv("sales.csv")

# select second row
print(df.iloc[1])

Company       GOOG
Person     Charlie
Sales          120
Tax           0.12
Name: 1, dtype: object

In [50]:
# select third to fourth row
print(df.iloc[2:4])

  Company   Person  Sales   Tax
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07

In [51]:
# create a new copy of df
df2 = df.copy()
print(df2)

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12

In [52]:
# make Person the Labels of Each Row
df2.set_index("Person", inplace = True)
print(df2)

        Company  Sales   Tax
Person
Sam        GOOG    200  0.12
Charlie    GOOG    120  0.12
Amy        MSFT    340  0.08
Vanessa    MSFT    124  0.07
Carl         FB    243  0.06
Sarah        FB    350  0.12

In [58]:
print(df2)

        Company  Sales   Tax
Person
Sam        GOOG    200  0.12
Charlie    GOOG    120  0.12
Amy        MSFT    340  0.08
Vanessa    MSFT    124  0.07
Carl         FB    243  0.06
Sarah        FB    350  0.12

In [59]:
# Select the row for Sam
print(df.iloc[0])
print(df2.loc['Sam'])

Company    GOOG
Person      Sam
Sales       200
Tax        0.12
Name: 0, dtype: object
Company    GOOG
Sales       200
Tax        0.12
Name: Sam, dtype: object

In [61]:
# Select Rows for Sam and Amy
print(df2.loc[['Sam','Amy']])

       Company  Sales   Tax
Person
Sam       GOOG    200  0.12
Amy       MSFT    340  0.08

In [64]:
# Select Rows for Sam and Amy and
# show only Company and Tax
print(df2.loc[['Sam','Amy'],['Company','Tax']])

       Company   Tax
Person
Sam       GOOG  0.12
Amy       MSFT  0.08

In [67]:
# identify rows of where sales > 150
print(df['Sales'])
print(df['Sales'] >150)

0    200
1    120
2    340
3    124
4    243
5    350
Name: Sales, dtype: int64
0     True
1    False
2     True
3    False
4     True
5     True
Name: Sales, dtype: bool

In [69]:
# select rows of df where sales >150
print(df[df['Sales'] >150])

  Company Person  Sales   Tax
0    GOOG    Sam    200  0.12
2    MSFT    Amy    340  0.08
4      FB   Carl    243  0.06
5      FB  Sarah    350  0.12

In [71]:
# select rows of df where Sales >150 and select only columns 
#Person and Tax
print(df[df['Sales']>150])

  Company Person  Sales   Tax
0    GOOG    Sam    200  0.12
2    MSFT    Amy    340  0.08
4      FB   Carl    243  0.06
5      FB  Sarah    350  0.12

In [75]:
# select rows of df where Sales >150 and select only rows 
#Company #= FB and select only columns Person and Tax
print(df[(df['Sales'] >150) & (df['Company']=='FB')][['Person','Tax']])

  Person   Tax
4   Carl  0.06
5  Sarah  0.12

In [77]:
df.loc[(df['Sales'] >150) & (df['Company']=='FB'), ['Person','Tax']]

  Person   Tax
4   Carl  0.06
5  Sarah  0.12

# Checkpoint

In this exercise, we are using Automobile Dataset for data analysis. This Dataset has different characteristics of an auto such as body-style, wheel-base, engine-type, price, mileage, horsepower, etc.

* Exercise 1: From the given dataset print the first and last five rows
* Exercise 2: Print All Toyota Cars details
* Exercise 3: Sort all cars by Price column. [See reference](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html)
* Exercise 4: Count total cars per company. [See reference](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.core.groupby.SeriesGroupBy.value_counts.html?highlight=value_counts#pandas.core.groupby.SeriesGroupBy.value_counts)
* Exercise 5: See all toyota cars with hatchback body style
* Exercise 6: **Set** all toyota cars with hatchback body style with mileage=90

In [138]:
# exercise1
car_df = pd.read_csv('Automobile_data.csv')
# first and last five rows (separate)
#print(car_df[:5])
#print(car_df[-5:])

#print(car_df.head(5))
#print(car_df.tail(5))

# both
car_first_5 = car_df.head(5)
car_last_5 = car_df.tail(5)
car_df1 = pd.concat([car_first_5, car_last_5])
car_df1

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [119]:
# exercise 2
car_df[car_df['company']=='toyota']

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

In [122]:
# exercise 3
#Sort all cars by Price column. See reference
car_df.sort_values(by=['price', 'engine-type'])

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
36,49,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
28,37,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0
...,...,...,...,...,...,...,...,...,...,...
11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
23,32,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN

In [100]:
# exercise 4
car_df['company'].value_counts()

toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: company, dtype: int64

In [114]:
# exercise 5
car_df[(car_df['body-style']=='hatchback') & (car_df['company']=='toyota')]
car_df.loc[(car_df['body-style']=='hatchback') & (car_df['company']=='toyota')]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0

In [153]:
# exercise 6
#Set all toyota cars with hatchback body style with mileage=90
car_df = pd.read_csv('Automobile_data.csv')
print("before")
print(car_df.loc[(car_df['body-style']=='hatchback') & (car_df['company']=='toyota'), 'average-mileage'])
car_df.loc[(car_df['body-style']=='hatchback') & (car_df['company']=='toyota'), 'average-mileage'] = 90
print("after")
print(car_df.loc[(car_df['body-style']=='hatchback') & (car_df['company']=='toyota'), 'average-mileage'])

before
48    35
49    31
50    31
Name: average-mileage, dtype: int64
after
48    90
49    90
50    90
Name: average-mileage, dtype: int64

# Data Processing
* Data is usually not in its final form needed for most of the analytics methodologies. 
* Data in the real world is dirty
    – incomplete: lacking attribute values, lacking certain attributes of interest, or containing only aggregate data (e.g., occupation=" ")
    – noisy: containing errors or outliers (e.g., Salary="-10")
    – inconsistent: containing discrepancies in codes or names (e.g., Age=“42” Birthday=“03/07/1997”)
* Hence the need for Data Processing

## Data Transformation
* Aggregation: summarization, data cube construction
* Melting: Conversion of short to long datasets
* Pivoting: Conversion of long datasets to short
* Generalization: concept hierarchy climbing (numeric values for age or youth, adult senior)
* Normalization: scaled to fall within a small, specified range
    - min-max normalization
    – z-score standardization
* Attribute/feature construction
    - New attributes constructed from the given ones

## Why Is Data Processing Important?
* No quality data, no quality mining results!
    - Quality decisions must be based on quality data (e.g., duplicate or missing data may cause incorrect or even misleading statistcs.)
    - Data warehouse needs consistent integration of quality data
    - Data extraction, cleaning, and transformation comprises the majority of the work of building a data warehouse

## DataFrame Aggregation Operations
* Aggregation functions can be applied to groups of data based on values of specific columns.
* Utilized the groupby() command
* Output is a dataframe where the following sample operations can be done by group
    * df.mean() #get mean
    * df.std() #get standard dev
    * df.min() #get min
    * df.max() #get max
    * df.count() # count the number of elements
    * df.describe() # compute for various desc. stat

In [157]:
#Summarizing Data
print(df.mean())
print("\n")
print(df.std())
print("\n")
print(df.min())
print("\n")
print(df.max())
print("\n")
print(df.count())
print("\n")
print(df.describe())

Sales    229.500
Tax        0.095
dtype: float64


Sales    100.899455
Tax        0.028107
dtype: float64


Company      FB
Person      Amy
Sales       120
Tax        0.06
dtype: object


Company       MSFT
Person     Vanessa
Sales          350
Tax           0.12
dtype: object


Company    6
Person     6
Sales      6
Tax        6
dtype: int64


            Sales       Tax
count    6.000000  6.000000
mean   229.500000  0.095000
std    100.899455  0.028107
min    120.000000  0.060000
25%    143.000000  0.072500
50%    221.500000  0.100000
75%    315.750000  0.120000
max    350.000000  0.120000

C:\Users\Sam\AppData\Local\Temp/ipykernel_2464/1344212576.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.mean())
C:\Users\Sam\AppData\Local\Temp/ipykernel_2464/1344212576.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.std())

In [167]:
# groupby aggregation
by_comp = df.groupby("Company")
print(by_comp.mean())
print("\n")
print(by_comp.std())
print("\n")
print(by_comp.min())
print("\n")
print(by_comp.max())
print("\n")
print(by_comp.count())
print("\n")
print(by_comp.describe())

         Sales    Tax
Company
FB       296.5  0.090
GOOG     160.0  0.120
MSFT     232.0  0.075


              Sales       Tax
Company
FB        75.660426  0.042426
GOOG      56.568542  0.000000
MSFT     152.735065  0.007071


          Person  Sales   Tax
Company
FB          Carl    243  0.06
GOOG     Charlie    120  0.12
MSFT         Amy    124  0.07


          Person  Sales   Tax
Company
FB         Sarah    350  0.12
GOOG         Sam    200  0.12
MSFT     Vanessa    340  0.08


         Person  Sales  Tax
Company
FB            2      2    2
GOOG          2      2    2
MSFT          2      2    2


        Sales                                                           Tax  \
        count   mean         std    min     25%    50%     75%    max count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0   2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0   2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0   2.0


          mean       std   min     25%    50%     75%   max
Company
FB       0.090  0.042426  0.06  0.0750  0.090  0.1050  0.12
GOOG     0.120  0.000000  0.12  0.1200  0.120  0.1200  0.12
MSFT     0.075  0.007071  0.07  0.0725  0.075  0.0775  0.08

# Melting
* Melting is the process of transforming measures/facts into a single column/variable 
* Melt by Mass and Velocity Example

In [173]:
print(df)
dfmelted = df.copy()
dfmelted = pd.melt(dfmelted, id_vars=['Company'], value_vars=['Sales', 'Person', 'Tax'])
print(dfmelted)

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12
   Company variable    value
0     GOOG    Sales      200
1     GOOG    Sales      120
2     MSFT    Sales      340
3     MSFT    Sales      124
4       FB    Sales      243
5       FB    Sales      350
6     GOOG   Person      Sam
7     GOOG   Person  Charlie
8     MSFT   Person      Amy
9     MSFT   Person  Vanessa
10      FB   Person     Carl
11      FB   Person    Sarah
12    GOOG      Tax     0.12
13    GOOG      Tax     0.12
14    MSFT      Tax     0.08
15    MSFT      Tax     0.07
16      FB      Tax     0.06
17      FB      Tax     0.12

## Pivoting
* Reshaped DataFrame organized by given index / column values.

In [175]:
print(df)
dfpivot = df.copy()
dfpivot = dfpivot.pivot(index='Person', columns='Company', values='Sales')
print(dfpivot)

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12
Company     FB   GOOG   MSFT
Person
Amy        NaN    NaN  340.0
Carl     243.0    NaN    NaN
Charlie    NaN  120.0    NaN
Sam        NaN  200.0    NaN
Sarah    350.0    NaN    NaN
Vanessa    NaN    NaN  124.0

# Data Integration (ETL)

* Data integration: 
    - Combines data from multiple sources into a coherent store
* Schema integration: e.g., A.cust-id  B.cust-#
    - Integrate metadata from different sources
* Entity identification problem: 
    - Identify real world entities from multiple data sources, e.g., Bill Clinton = William Clinton
* Detecting and resolving data value conflicts
    - For the same real world entity, attribute values from different sources are different
* Possible reasons: different representations, different scales, e.g., metric vs. British units

## Merging

In [177]:
query = "SELECT * FROM sql_country"
country_df = pd.read_sql_query(query, conn)
print(country_df)

print("\n")

query = "SELECT * FROM sql_people"
people_df = pd.read_sql_query(query, conn)
print(people_df)

   id      country
0   1  Philippines
1   2   Tajikistan
2   3       Brazil
3   4       Brazil
4   5     Colombia
5   6    Indonesia


   id  country_id       name
0   1         NaN      Colas
1   2         5.0  Fleurette
2   3         NaN       Lara
3   4         NaN      Parke
4   5         2.0    Enrique

In [178]:
pd.merge(country_df, people_df, left_on='id', right_on='country_id', how='inner')

   id_x     country  id_y  country_id       name
0     2  Tajikistan     5         2.0    Enrique
1     5    Colombia     2         5.0  Fleurette

In [179]:
pd.merge(country_df, people_df, left_on='id', right_on='country_id', how='outer')

   id_x      country  id_y  country_id       name
0   1.0  Philippines   NaN         NaN        NaN
1   2.0   Tajikistan   5.0         2.0    Enrique
2   3.0       Brazil   NaN         NaN        NaN
3   4.0       Brazil   NaN         NaN        NaN
4   5.0     Colombia   2.0         5.0  Fleurette
5   6.0    Indonesia   NaN         NaN        NaN
6   NaN          NaN   1.0         NaN      Colas
7   NaN          NaN   3.0         NaN       Lara
8   NaN          NaN   4.0         NaN      Parke

In [180]:
pd.merge(country_df, people_df, left_on='id', right_on='country_id', how='left')

   id_x      country  id_y  country_id       name
0     1  Philippines   NaN         NaN        NaN
1     2   Tajikistan   5.0         2.0    Enrique
2     3       Brazil   NaN         NaN        NaN
3     4       Brazil   NaN         NaN        NaN
4     5     Colombia   2.0         5.0  Fleurette
5     6    Indonesia   NaN         NaN        NaN

In [181]:
pd.merge(country_df, people_df, left_on='id', right_on='country_id', how='right')

   id_x     country  id_y  country_id       name
0   NaN         NaN     1         NaN      Colas
1   5.0    Colombia     2         5.0  Fleurette
2   NaN         NaN     3         NaN       Lara
3   NaN         NaN     4         NaN      Parke
4   2.0  Tajikistan     5         2.0    Enrique

In [182]:
country_df.merge(people_df, left_on='id', right_on='country_id', how='inner')

   id_x     country  id_y  country_id       name
0     2  Tajikistan     5         2.0    Enrique
1     5    Colombia     2         5.0  Fleurette

## Concatenating

In [187]:
df1 = pd.read_csv("df1.csv")
df2 = pd.read_csv("df2.csv")
df3 = pd.read_csv("df3.csv")
print(df1)
print(df2)
print(df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7
     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

     A    B    C
0   A8   B8   C8
1   A9   B9   C9
2  A10  B10  C10
3  A11  B11  C11

In [189]:
pd.concat([df1,df2,df3])

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [192]:
pd.concat([df1,df2,df3], axis =1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

# Data Transformation

![normalization](./media/normalization.png)

![](./media/zscore.png)`

![](./media/instruction.png)

In [ ]:
dfscaled = df.copy()
dfscaled['SalesScaled'] = (df['Sales']-df['Sales'].min())/(df['Sales'].max()-df['Sales'].min())*(5-1)+1
print(dfscaled)

print("\n")

dfscaled['TaxScaled'] = (df['Tax']-df['Tax'].mean())/df['Tax'].std()
print(dfscaled)

## Binning
* Binning: Process of transforming numerical variables into categorical counterparts. 
    - An example is to bin values for Age into categories such as 1 to 18, 18 to 49, and 49 onwards. 
* Rationale: Some Data Mining Algorithms run better on Categorical Data: e.g. Decision Trees
* Allows easy identification of outliers

**Two Types of Binning**
* Equal-width (distance) partitioning
    * Divides the range into 𝑁 intervals of equal size: uniform grid
    * if A and B are the lowest and highest values of the attribute, the width of intervals will be: 𝑊 = (𝐵 – 𝐴)/𝑁.
    * The most straightforward, but outliers may dominate presentation
    * Skewed data is not handled well
* Equal-depth (frequency) partitioning
    * Divides the range into N intervals, each containing approximately same number of samples
    * Good data scaling and outliers

In [193]:
# Equal Width Binning
import numpy as np
dfbinned = df.copy()
bin_labels_3 = ['Low', 'Medium', 'High']
cutbins = np.arange(0,4,1)/3*(df['Tax'].max() - df['Tax'].min())+df['Tax'].min()
print(cutbins)
dfbinned['TaxDiscrete'] = pd.cut(df['Tax'], bins=cutbins, labels=bin_labels_3)
dfbinned=dfbinned.fillna(value="Low")
print(dfbinned)

[0.06, 0.08) low
[0.08, 0.10) medium
[0.10: 0.12] high

[0.06 0.08 0.1  0.12]
  Company   Person  Sales   Tax TaxDiscrete
0    GOOG      Sam    200  0.12        High
1    GOOG  Charlie    120  0.12        High
2    MSFT      Amy    340  0.08      Medium
3    MSFT  Vanessa    124  0.07         Low
4      FB     Carl    243  0.06         Low
5      FB    Sarah    350  0.12        High

In [194]:
# Equal Depth Binning
dfbinned = df.copy()
bin_labels_3 = ['Low', 'Medium', 'High']
dfbinned['SalesDiscrete'] = pd.qcut(df['Sales'], q=3, labels=bin_labels_3)
print(dfbinned)

  Company   Person  Sales   Tax SalesDiscrete
0    GOOG      Sam    200  0.12        Medium
1    GOOG  Charlie    120  0.12           Low
2    MSFT      Amy    340  0.08          High
3    MSFT  Vanessa    124  0.07           Low
4      FB     Carl    243  0.06        Medium
5      FB    Sarah    350  0.12          High

## Data Encoding
* Encoding or continuation is the transformation of categorical variables to binary or numerical counterparts. 
    * An example is to treat male or female for gender as 1 or 0. 
* Some Data Mining Methodologies require all data to be 
numerical, e.g. Linear Regression
* Sometimes called Dummy Variables
* Two Types
    * Binary Encoding (Unsupervised) 
    * Class-based Encoding (Supervised)

In [198]:
dfencoding = df.copy()
df['Company'].unique()
dummies = pd.get_dummies(dfencoding['Company'], prefix='Company')
dfencoding = pd.concat([dfencoding,dummies], axis=1)
print(dfencoding)

  Company   Person  Sales   Tax  Company_FB  Company_GOOG  Company_MSFT
0    GOOG      Sam    200  0.12           0             1             0
1    GOOG  Charlie    120  0.12           0             1             0
2    MSFT      Amy    340  0.08           0             0             1
3    MSFT  Vanessa    124  0.07           0             0             1
4      FB     Carl    243  0.06           1             0             0
5      FB    Sarah    350  0.12           1             0             0

## Missing Data
* Data is not always available
    - E.g., many tuples have no recorded value for several attributes, such as 
customer income in sales data
* Missing data may be due to 
    - equipment malfunction
    - inconsistent with other recorded data and thus deleted
    - data not entered due to misunderstanding
    - data may not be considered important at the time of entry
    - not register history or changes of the data
* Missing data may need to be inferred.

**Handling Missing Data**
* Ignore the tuple: usually done when class label is missing (assuming the tasks in classification—not effective when the percentage of missing values per attribute varies considerably.)
* Fill in the missing value manually: tedious + infeasible?
* Data Imputation
    - Fill in it automatically with
* a global constant : e.g., “unknown”, a new class?
* the attribute mean
* the attribute mean for all samples belonging to the same class: 
smarter

## Data Reduction/Manipulation

* Data may not be balanced. 
* E.g.: Medical Dataset with 9900 negative cases and only 100 positive cases.
* Solved by:
    - Upsampling: Randomly select tuples from minority class to 
increase samples (sometimes called Bootstrapping)
    - Downsampling: Randomly select records from majority class to decrease samples
    
**Types of Sampling**
* Simple Random Sampling
    - There is an equal probability of selecting any particular item
* Sampling without replacement
    - As each item is selected, it is removed from the population
* Sampling with replacement
    - Objects are not removed from the population as they are selected 
for the sample. 
* In sampling with replacement, the same object can be picked up more than once
* Stratified sampling
    - Split the data into several partitions; then draw random samples from each partition

In [199]:
# simple random sampling
dfsample = df.copy()
dfsamplesubset = dfsample.sample(n=3,replace=True, 
random_state=1)
print(dfsamplesubset)

  Company   Person  Sales   Tax
5      FB    Sarah    350  0.12
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06

# Checkpoint:

In this exercise, we are using Automobile Dataset for data analysis. This Dataset has different characteristics of an auto such as body-style, wheel-base, engine-type, price, mileage, horsepower, etc.

* Replace all column values which contain ?, n.a, or NaN. [See Reference1](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html?highlight=replace#pandas.DataFrame.replace) [See Reference2](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.fillna.html?highlight=fillna)
* Find the most expensive car company name
* Find each company’s Higesht price car
* Find the average mileage of each car making company